In [230]:
import pandas as pd
import numpy as np

In [231]:
#  read the data into Python from the indicated csv
df = pd.read_csv(r'Data-Science-Projects-with-Python-master\Data\default_of_credit_card_clients__courseware_version_1_21_19.csv')

In [232]:
#  list the df column names
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

In [233]:
#  show the first 5 (default) records in df
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2.0,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1.0,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0.0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0.0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1.0,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [234]:
#  show the first 10 records in df
df.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2.0,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1.0,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0.0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0.0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1.0,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
5,ceae2946-47e4,50000,1,1,2,37,0.0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0
6,d3b8ce26-9c89,500000,1,1,2,29,0.0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,0
7,d6e1911b-54d0,100000,2,2,2,23,0.0,-1,-1,0,...,221,-159,567,380,601,0,581,1687,1542,0
8,8421d3b3-2b54,140000,2,3,1,28,0.0,0,2,0,...,12211,11793,3719,3329,0,432,1000,1000,1000,0
9,62a2fd79-cd90,20000,1,3,2,35,-2.0,-2,-2,-2,...,0,13007,13912,0,0,0,13007,1122,0,0

In [235]:
#  show the last 5 (default) records in df
df.tail()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
29995,ecff42d0-bdc6,220000,1,3,1,39,0.0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,99d1fa0e-222b,150000,1,3,2,43,-1.0,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,95cdd3e7-4f24,30000,1,2,2,37,4.0,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,00d03f02-04cd,80000,1,3,1,41,1.0,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,15d69f9f-5ad3,50000,1,2,1,46,0.0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [236]:
#  number of unique values in a series 'ID' (series = column)
df['ID'].nunique()

29687

In [237]:
#  dimensions of the df (rows, columns)
df.shape

(30000, 25)

In [238]:
#  count the number of instances in df for each unique record in series 'ID'
#  can be used to check for repeat records
df['ID'].value_counts()

ID
7d5f3242-e1df    2
1b22b0ab-aba3    2
4cb27699-fe3f    2
91c69d1a-8732    2
bf23c70b-bf12    2
                ..
cb258690-8ea2    1
f6f0307a-b75f    1
47a4cdaa-aa20    1
834b2cac-750e    1
429d2c82-67ae    1
Name: count, Length: 29687, dtype: int64

In [239]:
#  count how many records are unique (29374) and how many records have duplicates (313)
(df['ID'].value_counts()).value_counts()

count
1    29374
2      313
Name: count, dtype: int64

Logical Masks aka Boolean Masks

In [240]:
id_counts = df['ID'].value_counts()

In [241]:
#  this boolean mask labels records satisfying the defined condition as True, and False otherwise
#  in this case, we're looking for duplicate IDs, so we're returning records with IDs that accur 2 times in the dataset
#  this will be the coolean mask
duplicates_mask = id_counts==2

In [242]:
#  29374 records do not satisfy the defined condition
#  313 records do satisfy the defined condition
duplicates_mask.value_counts()

count
False    29374
True       313
Name: count, dtype: int64

In [243]:
#  store only the records satisfying the defined condition in a variable
duplicate_ids = id_counts.index[duplicates_mask]

In [244]:
#  convert the container from 'object' to a list
duplicate_ids = list(duplicate_ids)

In [245]:
duplicate_ids[:5]

['7d5f3242-e1df',
 '1b22b0ab-aba3',
 '4cb27699-fe3f',
 '91c69d1a-8732',
 'bf23c70b-bf12']

In [246]:
#  use .isin() to identify records in the 'ID' series with the first 3 values in duplicate_ids
bool_mask = df['ID'].isin(duplicate_ids[0:3])

In [247]:
#  apply the boolean mask to df with .loc, indexing the selected rows and all columns
df.loc[bool_mask,:]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
5374,1b22b0ab-aba3,30000,2,1,2,30,0.0,0,0,0,...,32389,33142,33999,1600,2000,1500,1200,1330,2500,0
5474,1b22b0ab-aba3,0,0,0,0,0,0.0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
5583,7d5f3242-e1df,60000,1,1,2,22,NaN,0,2,0,...,29137,29900,30069,4400,304,1100,1216,1300,589,0
5683,7d5f3242-e1df,0,0,0,0,0,0.0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
11848,4cb27699-fe3f,60000,2,6,1,39,-1.0,-1,-1,-1,...,2248,0,449,1419,3541,2248,0,449,0,0
11948,4cb27699-fe3f,0,0,0,0,0,0.0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [248]:
#  notice that there are multiple rows with '0' for all column values.  These rows are duplicate records (recall the duplicate_ids boolean mask), so we want to clean up the data by removing these entries from the data set

In [249]:
#  create an all-zeros boolean matrix the same dimensions as df
df_zeros_mask = df==0
print(df_zeros_mask)

          ID  LIMIT_BAL    SEX  EDUCATION  MARRIAGE    AGE  PAY_1  PAY_2  \
0      False      False  False      False     False  False  False  False
1      False      False  False      False     False  False  False  False
2      False      False  False      False     False  False   True   True
3      False      False  False      False     False  False   True   True
4      False      False  False      False     False  False  False   True
...      ...        ...    ...        ...       ...    ...    ...    ...
29995  False      False  False      False     False  False   True   True
29996  False      False  False      False     False  False  False  False
29997  False      False  False      False     False  False  False  False
29998  False      False  False      False     False  False  False  False
29999  False      False  False      False     False  False   True   True

       PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2  \
0      False  False  ...       True       True       True      True     False
1       True   True  ...      False      False      False      True     False
2       True   True  ...      False      False      False     False     False
3       True   True  ...      False      False      False     False     False
4      False   True  ...      False      False      False     False     False
...      ...    ...  ...        ...        ...        ...       ...       ...
29995   True   True  ...      False      False      False     False     False
29996  False  False  ...      False      False       True     False     False
29997  False  False  ...      False      False      False      True      True
29998   True   True  ...      False      False      False     False     False
29999   True   True  ...      False      False      False     False     False

       PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6  default payment next month
0          True      True      True      True                       False
1         False     False      True     False                       False
2         False     False     False     False                        True
3         False     False     False     False                        True
4         False     False     False     False                        True
...         ...       ...       ...       ...                         ...
29995     False     False     False     False                        True
29996     False     False      True      True                        True
29997     False     False     False     False                       False
29998     False     False     False     False                       False
29999     False     False     False     False                       False

[30000 rows x 25 columns]

In [250]:
#  take index 5474 from df_zeros_mask.  It shows all Trues for columns 1-24 (column 0 is the index value).  The boolean mask we applied to achieve this result applies True for any cell value 0, and False otherwise.  This row was all zeros (what we're looking for), so the entire row was True in the mask generated.
#  .iloc[<int>] is an index locator, which returns the record located at the indicated index
df_zeros_mask.iloc[5474]

ID                            False
LIMIT_BAL                      True
SEX                            True
EDUCATION                      True
MARRIAGE                       True
AGE                            True
PAY_1                          True
PAY_2                          True
PAY_3                          True
PAY_4                          True
PAY_5                          True
PAY_6                          True
BILL_AMT1                      True
BILL_AMT2                      True
BILL_AMT3                      True
BILL_AMT4                      True
BILL_AMT5                      True
BILL_AMT6                      True
PAY_AMT1                       True
PAY_AMT2                       True
PAY_AMT3                       True
PAY_AMT4                       True
PAY_AMT5                       True
PAY_AMT6                       True
default payment next month     True
Name: 5474, dtype: bool

In [251]:
#  create an aggregate boolean for all rows and columns 1-24 (omit column 0) with .all(), passing in the axis=1 parameter to indicate that we are checking along the columns
feature_zero_mask = df_zeros_mask.iloc[:,1:].all(axis=1)
print(feature_zero_mask)

0        False
1        False
2        False
3        False
4        False
         ...
29995    False
29996    False
29997    False
29998    False
29999    False
Length: 30000, dtype: bool

In [252]:
#  remember that the zeros boolean mask tagged cells with 0 as True and all others False.  Knowing that True=1 and False=0, we sum the aggregate boolean of each row, and the result is the number of rows (i.e. records) that do not have data (zeros in all columns)
sum(feature_zero_mask)

315

In [253]:
#  remove these recoreds from df, but assign it as a copy in a different variable to not modify the otiginal df
df_clean_0 = df.loc[-feature_zero_mask, :].copy()
print(df_clean_0.shape)

(29685, 25)

In [254]:
#  check how many unique values there are in the 'ID' series in df_clean_0
df_clean_0['ID'].nunique()

29685

In [255]:
#  check how many unique values there are in the 'ID' series in df_clean_0
id_counts_clean_0 = df_clean_0['ID'].value_counts()
id_counts_clean_0.value_counts()

count
1    29685
Name: count, dtype: int64

Data Exploration and Cleaning

In [ ]:
#  get information about the data table, including column names and data types
#  regarding data explotaion, we see the count for each column's non-null values
#  notice that 'PAY_1' has less non-null values that all the other columns, indicating that there is missing data in that column
df_clean_0.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29685 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          29685 non-null  object
 1   LIMIT_BAL                   29685 non-null  int64
 2   SEX                         29685 non-null  int64
 3   EDUCATION                   29685 non-null  int64
 4   MARRIAGE                    29685 non-null  int64
 5   AGE                         29685 non-null  int64
 6   PAY_1                       26664 non-null  float64
 7   PAY_2                       29685 non-null  int64
 8   PAY_3                       29685 non-null  int64
 9   PAY_4                       29685 non-null  int64
 10  PAY_5                       29685 non-null  int64
 11  PAY_6                       29685 non-null  int64
 12  BILL_AMT1                   29685 non-null  int64
 13  BILL_AMT2                   29685 non-null  int64
 14  BILL_AMT3                   29685 non-null  int64
 15  BILL_AMT4                   29685 non-null  int64
 16  BILL_AMT5                   29685 non-null  int64
 17  BILL_AMT6                   29685 non-null  int64
 18  PAY_AMT1                    29685 non-null  int64
 19  PAY_AMT2                    29685 non-null  int64
 20  PAY_AMT3                    29685 non-null  int64
 21  PAY_AMT4                    29685 non-null  int64
 22  PAY_AMT5                    29685 non-null  int64
 23  PAY_AMT6                    29685 non-null  int64
 24  default payment next month  29685 non-null  int64
dtypes: float64(1), int64(23), object(1)
memory usage: 5.9+ MB

In [ ]:
#  series "PAY_1" is the status of the most recent month's bill using values -1,1,2,3,... (defined in the data dictionary).  Follow up with data owner to find out why there are undefined tags in this column
df_clean_0['PAY_1'].value_counts()

PAY_1
 0.0    13087
-1.0     5047
 1.0     3261
-2.0     2476
 2.0     2378
 3.0      292
 4.0       63
 5.0       23
 8.0       17
 6.0       11
 7.0        9
Name: count, dtype: int64

In [ ]:
#  we see that there are status values of 0 and -2, which are not defined in the data dictionary.  
#  There are also missing values (null values) in 'PAY_1', so build a boolean mask with .isnull()
pay_1_mask = df_clean_0['PAY_1'].isnull()
print(sum(pay_1_mask))

3021

In [ ]:
#  remove the values from df_clean_0 and save this newly cleaned dataframe in a new variable as a copy with .copy()
df_clean_1 = df_clean_0.loc[-pay_1_mask, :].copy()
print(df_clean_1.shape)

(26664, 25)

In [265]:
#  we also see that 'PAY_1' has a different datatype to other columns with similar data
#  recast the 'PAY_1' to int64 to match the rest of the data
df_clean_1['PAY_1'] = df_clean_1['PAY_1'].astype('int64')

In [266]:
df_clean_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26664 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          26664 non-null  object
 1   LIMIT_BAL                   26664 non-null  int64
 2   SEX                         26664 non-null  int64
 3   EDUCATION                   26664 non-null  int64
 4   MARRIAGE                    26664 non-null  int64
 5   AGE                         26664 non-null  int64
 6   PAY_1                       26664 non-null  int64
 7   PAY_2                       26664 non-null  int64
 8   PAY_3                       26664 non-null  int64
 9   PAY_4                       26664 non-null  int64
 10  PAY_5                       26664 non-null  int64
 11  PAY_6                       26664 non-null  int64
 12  BILL_AMT1                   26664 non-null  int64
 13  BILL_AMT2                   26664 non-null  int64
 14  BILL_AMT3                   26664 non-null  int64
 15  BILL_AMT4                   26664 non-null  int64
 16  BILL_AMT5                   26664 non-null  int64
 17  BILL_AMT6                   26664 non-null  int64
 18  PAY_AMT1                    26664 non-null  int64
 19  PAY_AMT2                    26664 non-null  int64
 20  PAY_AMT3                    26664 non-null  int64
 21  PAY_AMT4                    26664 non-null  int64
 22  PAY_AMT5                    26664 non-null  int64
 23  PAY_AMT6                    26664 non-null  int64
 24  default payment next month  26664 non-null  int64
dtypes: int64(24), object(1)
memory usage: 5.3+ MB